Repository: billy482/pcopy
Catalog: locale/pcopy.*.po
Languages: fr_fr

source: Error while opening file '%s' because %m
fr_fr: Erreur en ouvrant le fichier « %s » parceque %m

source: Available cryptographic hash functions:
fr_fr: Fonctions de hachage cryptographique :

source: Error: failed to create checksum file '%s'
fr_fr: Erreur : échec lors de la création du fichier d’empreinte « %s »

source: Error: failed to parse argument for --jobs parameter, '%s' should be an positive integer
fr_fr: Erreur : échec lors de l’analyse du paramètre de l’argument --jobs, « %s » doit être un entier positif

source: Error: failed to parse argument for --load-average parameter, '%s' should be an positive decimal greater than %.1f
fr_fr: Erreur : échec lors de l’analyse du paramètre de l’argument --load-average, « %s » doit être un décimal plus grand que %.1f

source: Error: failed to create log file '%s'
fr_fr: Erreur : échec lors de la création du fichier d’enregistrement « %s »

source: pCopy: parallel copying and checksumming
fr_fr: pCopy : copie et calcul d’empreinte en parralèle

source: version: %s, build: %s %s
fr_fr: version : %s, compilé : %s %s

source: Usage: pcopy [options] <src-files>... <dest-file>
fr_fr: Utilisation : pcopy [options] <src-files>... <dest-file>

source: -c, --checksum <hash> : Use <hash> as hash function,
fr_fr: -c, --checksum <hash> : Utilisez <hash> comme fonction de hachage,

source: Use 'help' to show available hash functions
fr_fr: Utilisez « help » pour afficher les fonctions de hachage disponibles

source: -C, --checksum-file <file> : Defer checksum checking after copy and write checksum into <file>
fr_fr: -C, --checksum-file <fichier> : Différe la vérification de l’empreinte cryptographique après la copie et écrit l’empreinte dans <fichier>

source: -h, --help : Show this and exit
fr_fr: -h, --help : Affiche ceci et quite

source: -j, --jobs <jobs> : Run <jobs> simultaneously, default value: number of cpus
fr_fr: -j, --jobs <jobs> : Exécute jusqu’à <jobs> tâches simultanément, value par défaut : nombre de processeurs

source: -l, --load-average <load> : Do not copy while load average exceed <load> in the last minute
fr_fr: -l, --load-average <load> : Ne copie pas tant que la charge système dépasse <load> pendant la dernière minute

source: -L, --log-file <file> : Log also into <file>
fr_fr: -L, --log-file <fichier> : Enregistre aussi dans <fichier>

source: -p, --pause : Pause at the end of copy
fr_fr: -p, --pause : Pause à la fin de la copie

source: thread_pool_run: error, not enought memory to start new thread
fr_fr: thread_pool_run : erreur, pas assez de mémoire pour démarrer un nouveau fil d’exécution

source: #%lu # recompute %s of '%s'
fr_fr: #%lu # recalcule du %s de « %s »

source: #%lu ! error fatal, failed to open '%s' for reading because %m
fr_fr: #%lu ! erreur fatale, échec lors de l’ouverture de « %s » en lecture parce que %m

source: #%lu ! error fatal, failed to get information of '%s' because %m
fr_fr: #%lu ! erreur fatale, échec lors de obtention des informations de « %s » parce que %m

source: #%lu ! error fatal, error while reading from '%s' because %m
fr_fr: #%lu ! erreur fatale, erreur en lisant depuis « %s » parce que %m

source: #%lu = digests match (digest: %s) '%s'
fr_fr: #%lu = empreintes correspondes (empreinte : %s) « %s »

source: #%lu ≠ digests mismatch between 'src file'[%s] and '%s'[%s]
fr_fr: #%lu ≠ empreintes ne correspondes pas entre « fichier src» [%s] et « %s » [%s]

source: #%lu @ copy regular file from '%s' to '%s'
fr_fr: #%lu @ copie le fichier ordinaire depuis « %s » vers « %s »

source: #%lu ! error fatal, failed to open '%s' for writing because %m
fr_fr: #%lu ! erreur fatale, échec à l’ouverture de « %s » en écriture parce que %m

source: #%lu ! warning, failed to change owner and group of '%s' because %m
fr_fr: #%lu ! attention, échec en changeant le propriétaire et le groupe de « %s » parce que %m

source: #%lu ! error fatal, error while writing to '%s' because %m
fr_fr: #%lu ! erreur fatale, erreur en écrivant dans « %s » parce que %m

source: #%lu # %s's sum of '%s' is %s
fr_fr: #%lu # l’empreinte %s de « %s » est %s

source: flushing data of '%s'
fr_fr: purge des données de « %s »

source: #%lu > flushing file '%s'
fr_fr: #%lu > synchronisation du fichier « %s »

source: #%lu ! error while flushing file from '%s' because %m
fr_fr: #%lu ! erreur lors de la synchronisation du fichier « %s »

source: #%lu ! error while repositioning file '%s' at it beginning
fr_fr: #%lu ! erreur en repositionnant le fichier au début « %s »

source: #%lu ! warning, error while reading from '%s' because %m
fr_fr: #%lu ! attention, erreur en lisant depuis « %s » parce %m

source: #%lu ≠ digests mismatch between '%s'[%s] and '%s'[%s]
fr_fr: #%lu ≠ empreintes ne correspondes pas entre « %s » [%s] et « %s » [%s]

source: Start pCopy %s (build: %s %s)
fr_fr: Démarrage de pCopy %s (compilé: %s %s)

source: recompute %s of '%s'
fr_fr: recalcule du %s de « %s »

source: #%lu ! error, failed to create new thread
fr_fr: #%lu ! erreur, échec en créant un nouveau fil d’exécution

source: Process finished
fr_fr: Processus terminé

source: #%lu ~ create block device '%s', major: %d, minor: %d
fr_fr: #%lu ~ création d’un périphérique du type bloc « %s », majeur: %d, mineur: %d

source: #%lu ! error, failed to create block device '%s' because %m
fr_fr: #%lu ! erreur, échec lors de la création d’un périphérique du type bloc « %s » parce que %m

source: #%lu ~ create character device '%s', major: %d, minor: %d
fr_fr: #%lu ~ création d’un périphérique du type charactère « %s », majeur: %d, mineur: %d

source: #%lu ! error, failed to create character device '%s' because %m
fr_fr: #%lu ! erreur, échec lors de la création d’un périphérique du type charactère « %s » parce que %m

source: #%lu ~ create directory '%s'
fr_fr: #%lu ~ création du répertoire « %s »

source: #%lu ! error, failed to create directory '%s' because %m
fr_fr: #%lu ! erreur, échec lors de la création du répertoire « %s » parce que %m

source: #%lu ! error, failed to list files from '%s' because %m
fr_fr: #%lu ! erreur, échec lors de l’inventaire des fichiers depuis « %s » parce que %m

source: #%lu ~ create fifo '%s'
fr_fr: #%lu ~ création d’un tube nommé « %s »

source: #%lu ! error, failed to create fifo '%s' because %m
fr_fr: #%lu ! erreur, échec lors de la création du tube nommé « %s » parce que %m

source: #%lu ! error, failed to reading symbolic link of '%s' because %m
fr_fr: #%lu ! erreur, échec lors de la lecture du lien symbolique de « %s » parce que %m

source: #%lu ~ create symbolic link '%s' => '%s'
fr_fr: #%lu ~ création du lien symbolique « %s » => « %s »

source: #%lu ! error, failed to create symbolic link '%s' because %m
fr_fr: #%lu ! erreur, échec lors de la création du lien symbolique « %s » parce que %m

source: #%lu ! warning, failed to change permission of '%s' because %m
fr_fr: #%lu ! attention, échec en changeant les permissions de « %s » parce que %m

source: copy from '%s' to '%s'
fr_fr: copie depuis « %s » vers « %s »
